Revit 2026 API

# TemperatureRatingTypeInsulationTypes Property

---

Get all insulation types defined in this temperature rating type and its corresponding material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InsulationTypeSet InsulationTypes { get; }
```
```vb
Public ReadOnly Property InsulationTypes As InsulationTypeSet
	Get
```
```cpp
public:
property InsulationTypeSet^ InsulationTypes {
	InsulationTypeSet^ get ();
}
```
```fsharp
member InsulationTypes : InsulationTypeSet with get
```

#### Property Value

InsulationTypeSet

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace